podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/FMC_MK11D5.svd.xml
<!--
Devices using this peripheral: 
      MK11D5
      MK11DA5
      MK11D5WS
      MK12D5
      MK21D5
      MK21DA5
      MK21D5WS
      MK22D5
      MKW21D5
      MKW22D5
      MKW24D5
-->
      <peripheral>
         <?sourceFile "FMC_MK11D5" ?>
         <name>FMC</name>
         <description>Flash Memory Controller</description>
         <groupName>FMC</groupName>
         <prependToName>FMC</prependToName>
         <headerStructName>FMC</headerStructName>
         <baseAddress>0x4001F000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0xC</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x100</offset>
            <size>0x20</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x200</offset>
            <size>0x40</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>PFAPR</name>
               <description>Flash Access Protection Register</description>
               <addressOffset>0x0</addressOffset>
               <resetValue>0xF8003F</resetValue>
               <fields>
                  <field>
                     <name>M0AP</name>
                     <description>Master 0 Access Protection\n
This field controls whether read and write access to the flash are allowed\n
based on the logical master number of the requesting crossbar switch master</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>No access allowed</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>Only read accesses</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>Only write accesses</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Read and write accesses</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="M0AP" > <name>M1AP</name> <description>Master 1 Access Protection</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="M0AP" > <name>M2AP</name> <description>Master 2 Access Protection</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="M0AP" > <name>M3AP</name> <description>Master 3 Access Protection</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="M0AP" > <name>M4AP</name> <description>Master 4 Access Protection</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="M0AP" > <name>M5AP</name> <description>Master 5 Access Protection</description> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="M0AP" > <name>M6AP</name> <description>Master 6 Access Protection</description> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="M0AP" > <name>M7AP</name> <description>Master 7 Access Protection</description> <bitOffset>14</bitOffset> </field>
                  <field>
                     <name>M0PFD</name>
                     <description>Master 0 Prefetch Disable\n
Disables prefetching for this master</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Prefetching enabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Prefetching is disabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="M0PFD" > <name>M1PFD</name> <description>Master 1 Prefetch Disable</description> <bitOffset>17</bitOffset> </field>
                  <field derivedFrom="M0PFD" > <name>M2PFD</name> <description>Master 2 Prefetch Disable</description> <bitOffset>18</bitOffset> </field>
                  <field derivedFrom="M0PFD" > <name>M3PFD</name> <description>Master 3 Prefetch Disable</description> <bitOffset>19</bitOffset> </field>
                  <field derivedFrom="M0PFD" > <name>M4PFD</name> <description>Master 4 Prefetch Disable</description> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="M0PFD" > <name>M5PFD</name> <description>Master 5 Prefetch Disable</description> <bitOffset>21</bitOffset> </field>
                  <field derivedFrom="M0PFD" > <name>M6PFD</name> <description>Master 6 Prefetch Disable</description> <bitOffset>22</bitOffset> </field>
                  <field derivedFrom="M0PFD" > <name>M7PFD</name> <description>Master 7 Prefetch Disable</description> <bitOffset>23</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>PFB0CR</name>
               <description>Flash Bank 0 Control Register</description>
               <addressOffset>0x4</addressOffset>
               <resetValue>0x3002001F</resetValue>
               <fields>
                  <field>
                     <name>B0SEBE</name>
                     <description>Bank 0 Single Entry Buffer Enable\n
This bit controls whether the single entry page buffer is enabled in response to flash read accesses.\n
A high-to-low transition of this bit forces the page buffer to be invalidated</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Buffer is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Buffer is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>B0IPE</name>
                     <description>Bank 0 Instruction Prefetch Enable
This bit controls whether prefetches (or speculative accesses) are initiated in response to instruction fetches</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Don&apos;t prefetch instruction fetches</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Prefetches instruction fetches</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>B0DPE</name>
                     <description>Bank 0 Data Prefetch Enable\n
This bit controls whether prefetches (or speculative accesses) are initiated in response to data references</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Don&apos;t prefetch for data references</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Prefetch for data references</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>B0ICE</name>
                     <description>Bank 0 Instruction Cache Enable\n
This bit controls whether instruction fetches are loaded into the cache</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Don&apos;t cache instruction fetches</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Cache instruction fetches</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>B0DCE</name>
                     <description>Bank 0 Data Cache Enable\n
This bit controls whether data references are loaded into the cache</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Don&apos;t cache data references</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Cache data references</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CRC</name>
                     <description>Cache Replacement Control\n
This 3-bit field defines the replacement algorithm for accesses that are cached</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b000</name>
                           <description>LRU across all four ways</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b001</name>
                           <description>Reserved</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b010</name>
                           <description>Independent LRU ways [0-1] ifetches, [2-3] data</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b011</name>
                           <description>Independent LRU ways [0-2] ifetches, [3] data</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1xx</name>
                           <description>Reserved</description>
                           <value>0b1xx</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>B0MW</name>
                     <description>Bank 0 Memory Width\n
This field defines the width of the memory bank</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>32 bits</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>64 bits</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>128 bits (if available)</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Reserved</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>S_B_INV</name>
                     <description>Invalidate Prefetch Speculation Buffer\n
When this bit is written, the prefetch speculation buffer and single entry buffer are immediately cleared</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0bX</name>
                           <description>Write 1 to invalidate</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CINV_WAY</name>
                     <description>Cache Invalidate Way x\n
When a bit within this field is written, the corresponding cache way is immediately invalidated:\n
\t- the way&apos;s tag, data, and valid contents are cleared</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>write-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0bX</name>
                           <description>Write 1 to invalidate</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLCK_WAY</name>
                     <description>Cache Lock Way x\n
These bits determine if the given cache way is locked such that its contents will not be displaced by future misses</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Cache way is unlocked</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Cache way is locked</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>B0RWSC</name>
                     <description>Read Wait State Control\n
This field defines the number of wait states required to access the bank 0 flash memory</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0bXXXX</name>
                           <description>Wait state (N+1)</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
