podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/FMC_MK11D5.svd.xml
            <register>
               <name>PFB1CR</name>
               <description>Flash Bank 1 Control Register</description>
               <addressOffset>0x8</addressOffset>
               <resetValue>0x3002001F</resetValue>
               <fields>
                  <field>
                     <name>B1SEBE</name>
                     <description>Single Entry Buffer Enable\n
This bit controls whether the single entry page buffer is enabled in response to flash read accesses.\n
Its operation is independent from bank 1&apos;s cache.\n
A high-to-low transition of this bit forces the page buffer to be invalidated</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Buffer is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Buffer is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>B1IPE</name>
                     <description>Instruction Prefetch Enable
This bit controls whether prefetches (or speculative accesses) are initiated in response to instruction fetches</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Don&apos;t prefetch instruction fetches</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Prefetches instruction fetches</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>B1DPE</name>
                     <description>Data Prefetch Enable\n
This bit controls whether prefetches (or speculative accesses) are initiated in response to data references</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Don&apos;t prefetch for data references</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Prefetch for data references</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>B1ICE</name>
                     <description>Instruction Cache Enable\n
This bit controls whether instruction fetches are loaded into the cache</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Don&apos;t cache instruction fetches</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Cache instruction fetches</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>B1DCE</name>
                     <description>Data Cache Enable\n
This bit controls whether data references are loaded into the cache</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Don&apos;t cache data references</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Cache data references</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>B1MW</name>
                     <description>Memory Width\n
This field defines the width of the bank 0 memory</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>32 bits</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>64 bits</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1x</name>
                           <description>Reserved</description>
                           <value>0b1x</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>B1RWSC</name>
                     <description>Read Wait State Control\n
This field defines the number of wait states required to access the bank 0 flash memory</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0bXXXX</name>
                           <description>Wait state (N+1)</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <cluster>
               <dim>4</dim>
               <dimIncrement>8</dimIncrement>
               <dimIndex>0,1,2,3</dimIndex>
               <name>TAGVDW,@pTAGVDW@i@f</name>
               <addressOffset>0x100</addressOffset>
               <register>
                  <name>S0,TAGVD0</name>
                  <description>Cache Tag Storage\nTag &amp; valid information for Set 0 in Way %s</description>
                  <addressOffset>0x0</addressOffset>
                  <fields>
                     <field>
                        <name>valid</name>
                        <description>Valid bit for cache entry</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>Entry is invalid</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Entry is valid</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>tag</name>
                        <description>Tag for cache entry</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>15</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0bX</name>
                              <description>Tag (address)</description>
                              <isDefault>true</isDefault>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register derivedFrom="S0,TAGVD0"> <name>S1,TAGVD1</name> <description>Cache Tag Storage\nTag &amp; valid information for Set 1 in Way %s</description> <addressOffset>0x4</addressOffset> </register>
            </cluster>
            <cluster>
               <dim>4</dim>
               <dimIncrement>16</dimIncrement>
               <dimIndex>0,1,2,3</dimIndex>
               <name>DATAW,@pDATAW@i@f</name>
               <addressOffset>0x200</addressOffset>
               <register>
                  <name>S0U,DATAW0U</name>
                  <description>Cache Data Storage (upper word)\n
Data storage for Set 0 in Way %s</description>
                  <addressOffset>0x0</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [63:32] of data entry</description>
                        <bitOffset>0</bitOffset>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0bX</name>
                              <description>Cached data</description>
                              <isDefault>true</isDefault>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S0L,DATAW0L</name>
                  <description>Cache Data Storage (lower word)\n
Data storage for Set 0 in Way %s</description>
                  <addressOffset>0x4</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [31:0] of data entry</description>
                        <bitOffset>0</bitOffset>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0bX</name>
                              <description>Cached data</description>
                              <isDefault>true</isDefault>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register derivedFrom="S0U,DATAW0U"> <name>S1U,DATAW1U</name> <description>Cache Data Storage (upper word)\nData storage for Set 1 in Way %s</description> <addressOffset>0x8</addressOffset> </register>
               <register derivedFrom="S0L,DATAW0L"> <name>S1L,DATAW1L</name> <description>Cache Data Storage (lower word)\nData storage for Set 1 in Way %s</description> <addressOffset>0xC</addressOffset> </register>
            </cluster>
         </registers>
      </peripheral>
